
# 写一个打印菜单的函数

def menu():
    print('+------------------------------+')
    print("|%s" %'(1)添加学生信息', ' ' * 14 + '|')
    print("|%s" %'(2)查看所有的学生信息',' ' * 8 + '|')
    print("|%s" %'(3)修改学生成绩',' ' * 14 + '|')
    print("|%s" %'(4)删除学生信息',' ' * 14 + '|')
    print("|%s" %'(5)按成绩从高到低打印学生信息','|')
    print("|%s" %'(6)按成绩从低到高打印学生信息','|')
    print("|%s" %'(7)按年龄从大到小打印学生信息','|')
    print("|%s" %'(8)按年龄从小到大打印学生信息','|')
    print("|%s" %'(9)保存学生信息到文件(si.txt)','|')
    print("|%s" %'(10)从文件中读取数据(si.txt)',' ' + '|')


    print("|%s" %'(q)退出',' ' * 22 + '|')
    print('+------------------------------+')

print('student_menu_83模块被导入')